const Offer = () => {

    return(
        <div className="bg-gray-100 dark:bg-gray-900 min-h-screen max-h-full">
            <div className="pt-2 mx-auto container px-4 xl:px-12 2xl:px-4">
                <h1 className="text-center mb-1 text-gray-800 dark:text-white text-4xl">Договор Публичной оферты</h1>
                <p className="mt-4 text-gray-800 dark:text-white text-2xl">
                    <ol className="list-none sm:list-disc md:list-decimal lg:list-disc xl:list-none">
                        <li>Общее положение
                            <ol className="list-decimal">
                                <li>sd</li>
                                <li>sd</li>
                            </ol>
                        </li>
                        <li>sd</li>
                    </ol>

                    Настоящий Договор является официальным предложением (публичной офертой) ФЛП Котенко Виталий Владимирович (в дальнейшем «Исполнитель») для полностью дееспособного физического лица (далее – «Пользователь»), которое примет настоящее предложение, на указанных ниже условиях.
                    В соответствии со статьей 633 Гражданского Кодекса Украины (ЦКУ), в случае принятия изложенных ниже условий и оплаты услуг юридическое или физическое лицо, производящее принятие этой оферты, становится Заказчиком (В соответствии со статьями 641, 642 Гражданского Кодекса Украины (ЦКУ) принятие оферты равносилен заключению Договора на условиях, изложенных в оферте).
                    Моментом полного и безоговорочного принятия Пользователем предложения Исполнителя заключить Договор оферты (принятием оферты) считается факт подтверждения готовности совершить оплату услуги Исполнителя, посредством нажатия кнопки «Купить» на сайте https://kaboom2.ru. Текст настоящего Договора-оферты (далее по тексту – «Договор») расположен по адресу: https://kaboom2.ru/offer.
                    Осуществляя принятие Договора в порядке, определенном п. 1.3 Договора, Пользователь подтверждает, что он ознакомлен, согласен, полностью и безоговорочно принимает все условия Договора в том виде, в каком они изложены в тексте Договора.
                    Пользователь согласен, что принятие Договора в порядке, указанном в п. 1.2 Договора является заключением Договора на условиях, изложенных в нем.
                    Договор не может быть отозван.
                    Договор не требует скрепления печатями и/или подписания Пользователем и Исполнителем (далее по тексту - Стороны) и сохраняет при этом юридическую силу.

                    Предмет договора

                    Предметом настоящего Договора является оказание платных услуг Исполнителем в соответствии с условиями настоящего Договора.
                    Пользователь полностью принимает условия Договора и оплачивает услуги Исполнителя в соответствии с условиями настоящего Договора.

                    Оплата Услуг

                    Стоимость услуг по Договору определяется в соответствии с действующими ценами и прописана на сайте https://kaboom2.ru.
                    Стоимость услуги может быть изменена Исполнителем в одностороннем порядке.
                    Способы оплаты услуги указаны при оформлении платежа.

                    Интеллектуальная собственность

                    Вся текстовая информация и графические изображения, находящиеся на сайте https://kaboom2.ru являются собственностью Исполнителя.

                    Особые условия и ответственность сторон

                    Исполнитель несет ответственность за своевременность предоставляемых услуг при выполнении Пользователем установленных требований и правил, размещенных на сайте https://kaboom2.ru.
                    Исполнитель освобождается от ответственности за нарушение условий Договора, если такое нарушение вызвано действием обстоятельств непреодолимой силы (форс-мажор), включая: действия органов государственной власти, пожар, наводнение, землетрясение, другие стихийные действия, отсутствие электроэнергии, забастовки, гражданские волнения, беспорядки, любые иные обстоятельства, не ограничиваясь перечисленным, которые могут повлиять на выполнение Исполнителем Договора.
                    Исполнитель не несет ответственности за качество каналов связи общего пользования или служб, предоставляющих доступ Пользователя к его услугам.

                    Порядок рассмотрения претензий и споров

                    Претензии Пользователя по предоставляемым услугам принимаются Исполнителем к рассмотрению по электронной почте (caunt.official@gmail.com) в течение 2 (рабочих) дней с момента возникновения спорной ситуации.
                    При рассмотрении спорных ситуаций Исполнитель вправе запросить у Пользователя всю интересующую документацию относительно рассматриваемого случая. В случае непредоставления Пользователем документов в течение 1 рабочего дня после дня требования, претензия рассмотрению Исполнителем не подлежит.
                    Исполнитель и Пользователь, принимая во внимания характер оказываемой услуги, обязуются в случае возникновения споров и разногласий, связанных с оказанием услуг, применять досудебный порядок урегулирования спора.

                    Прочие условия

                    Пользователь обладает всеми правами и полномочиями, необходимыми для заключения и исполнения Договора.
                    Пользователь вправе в любое время в одностороннем порядке отказаться от услуг Исполнителя. В случае одностороннего отказа Пользователя от услуг Исполнителя произведенная оплата не возвращается, но может быть перенесена на другую услугу.
                    Исполнитель оставляет за собой право изменять или дополнять любые из условий настоящего Договора в любое время, опубликовывая все изменения на своем сайте.
                    Договор считается совершенным и исполненным со стороны Исполнителя и Пользователя, в случае получения Пользователем покупки на сервере проекта (https://kaboom2.ru). В случае неисполнения договора Исполнителем, если с момента Оплаты услуг прошло не более 14 дней, Пользователь имеет право запросить возврат денежных средств, замену товара или товаров на сайте на сумму не превышающую первоначальную покупку.
                    По всем вопросам, не урегулированным настоящим Договором, стороны руководствуются действующим законодательством Украины.
                    Признание судом недействительности какого-либо положения настоящего Договора и правил не влечет за собой недействительность остальных положений.

                    Реквизиты Исполнителя

                    ФЛП Котенко Виталий Владимирович

                    ИНН 3632112399

                    ЕГРПОУ 3632112399
                    Контактные данные

                    Электронная почта caunt.official@gmail.com
                </p>
            </div>
        </div>
    )
}

export default Offer;